### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.apim.azurerm_api_management_api.fims will be created
  + resource "azurerm_api_management_api" "fims" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = (known after apply)
      + description           = "IO FIMS AppBackend API"
      + display_name          = "FIMS AppBackend"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-fims-api"
      + path                  = "api/fims"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = "v1"
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-backend/04671520b83cfaaab42821c7bd6b6f5bf6405b6c/openapi/generated/api_fims_platform.yaml"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.apim.azurerm_api_management_api_policy.io_fims_base will be created
  + resource "azurerm_api_management_api_policy" "io_fims_base" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-fims-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <include-fragment fragment-id="ioapp-authenticated" />
                    <set-backend-service id="apim-pool-app-backend"
                        backend-id="app-backend-pool" />
                    <set-header name="x-appbackend-api-key" exists-action="override">
                        <value>{{io-fims-app-backend-key}}</value>
                    </set-header>
                    <rewrite-uri template="@(context.Request.OriginalUrl.Path)" />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim.azurerm_api_management_api_tag.io_fims_api_tag will be created
  + resource "azurerm_api_management_api_tag" "io_fims_api_tag" {
      + api_id = (known after apply)
      + id     = (known after apply)
      + name   = "IO-FIMS"
    }

  # module.apim.azurerm_api_management_api_version_set.fims_v1 will be created
  + resource "azurerm_api_management_api_version_set" "fims_v1" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + display_name        = "FIMS AppBackend v1"
      + id                  = (known after apply)
      + name                = "fims_appbackend_v1"
      + resource_group_name = "io-p-itn-common-rg-01"
      + versioning_scheme   = "Segment"
    }

  # module.apim.azurerm_api_management_named_value.app_backend_key will be created
  + resource "azurerm_api_management_named_value" "app_backend_key" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + display_name        = "io-fims-app-backend-key"
      + id                  = (known after apply)
      + name                = "io-fims-app-backend-key"
      + resource_group_name = "io-p-itn-common-rg-01"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.apim.azurerm_api_management_product_api.io_fims will be created
  + resource "azurerm_api_management_product_api" "io_fims" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-fims-api"
      + id                  = (known after apply)
      + product_id          = "io-auth"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.apim.azurerm_api_management_tag.io_fims will be created
  + resource "azurerm_api_management_tag" "io_fims" {
      + api_management_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
      + display_name      = (known after apply)
      + id                = (known after apply)
      + name              = "IO-FIMS"
    }

  # module.itn_resource_group.azurerm_resource_group.this will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01"
        name       = "io-p-itn-fims-rg-01"
      ~ tags       = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
          - "ModuleName"     = "azure_github_environment_bootstrap" -> null
          - "ModuleSource"   = "DX" -> null
          - "ModuleVersion"  = "3.0.2" -> null
          ~ "Source"         = "https://github.com/pagopa/io-fims/tree/main/infra/bootstrapper/prod" -> "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (2 unchanged attributes hidden)
    }

Plan: 7 to add, 1 to change, 0 to destroy.
```

</details>
